tap "jurplel/tap"

brew "antidote"
brew "bat"
brew "eza"
brew "fzf"
brew "gh"
brew "lazygit"
brew "neovim", args: ["HEAD"]
brew "ripgrep"
brew "rustup"
brew "stow"
brew "tldr"
brew "tree-sitter"
brew "yazi"
brew "zig"
brew "zoxide"

cask "jurplel/tap/instant-space-switcher"
cask "font-hack-nerd-font"
