tap "jurplel/tap"

brew "antidote"
brew "ast-grep"
brew "bat"
brew "chafa"
brew "delta"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "hyperfine"
brew "jstkdng/programs/ueberzugpp"
brew "lazygit"
brew "neovim", args: ["HEAD"]
brew "resvg"
brew "ripgrep"
brew "rustup"
brew "scc"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree-sitter"
brew "typst"
brew "yazi"
brew "zig"
brew "zoxide"

cask "jurplel/tap/instant-space-switcher"
cask "font-hack-nerd-font"
cask "visual-studio-code"
